/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: rwaki <rwaki@student.42tokyo.jp>           +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/10/15 02:40:54 by rwaki             #+#    #+#             */
/*   Updated: 2022/10/15 03:08:12 by rwaki            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

int main(void)
{
	char i[16];/*入力された値を配列に変える*/
	i = 4321122243211222;

	int j;
	j = 0;

	while(i[j]==(0 && '\0')/*終端文字か0の場合はエラー*/
	{
		j++;
	}
	write (1, &"error", 6)

	str1[4]=i[4]{0~3}/*入力された数値を4つずつの配列にする*/
	str2[4]=i[4]{4~7}
	str3[4]=i[4]{8~11}
	str4[4]=i[4]{12~15}

	if(str1[j] ==4 && str3[j]==4)/*対面（str1,str3）（str2,str4）がぞれぞれ4.2 4.3 4,4 3.3 1.1の時はエラー*/
	{
		j++
	}
	write (1, &"error", 6)/*この動作を繰り返す*/
	/*これらの動作がクリアされた場合、次の関数に移動*/
	ft_annexe(i);

}
