/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   rush-01_5com.c                                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: asimmel <asimmel@student.42tokyo.jp>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/10/15 20:10:17 by yusyamas          #+#    #+#             */
/*   Updated: 2022/10/16 01:14:56 by asimmel          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <unistd.h>

//grid[][]をコマンドライン出力する
void	print_grid(int grid[4][4], int n)
{
	int		i;
	int		j;
	char	c;

	i = 0;
	while (i < n)
	{
		j = 0;
		while (j < n)
		{
			c = grid[i][j] + '0';
			write(1, &c, 1);
			if (j == n - 1)
				write(1, "\n", 1);
			else
				write(1, " ", 1);
			j += 1;
		}
		i += 1;
	}
}
